using EShop.Domain.Entities;
using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;

namespace EShop.Infrastructure.Data.Configurations
{
    public class CategoryConfiguration : IEntityTypeConfiguration<Category>
    {
        public void Configure(EntityTypeBuilder<Category> builder)
        {
            #region Seed Data Category

            builder.HasData(
                new Category
                {
                    Id = 1,
                    Name = "داستان و رمان",
                    Description =
                        @"داستان‌ها در ادبیات جهان سابقه دور و درازی دارند. این روایت‌ها از زمانی که قصه‌ها سینه به سینه منتقل می‌شدند وجود دارند تا ادبیات معاصر امروز. در هیچ دوره‌ای انسان‌ها بی نیاز از داستان‌ها نیستند. زیرا شیرینی بی‌نظیر و تکرار نشدنی در این وجود دارد که در خیال دیگران غرق شویم و تجربیات ناب لحظه‌های دیگران را مال خود بدانیم.
                داستان محصول ذهن خلاق فردی به نام نویسنده است که شخصیت‌های داستانش را ساخته و پرداخته و به زبان ادبی روایت می‌کند.یک داستان خوب می‌تواند مسیر زندگی شما را تغییر دهد؛ زیرا آموزه های آن در زندگی واقعی کاربرد فراوانی دارد.کتاب به انسان آگاهی می دهد و از تکرار خطاها و کج روی ها پیش گیری می کند.با مطالعه کتب داستانی متنوع می توانیم از حقوق فردی و اجتماعی خود آگاه شویم و از آن دفاع کنیم.
                هم چنین کتاب‌خوانی به کتاب‌خوان فرصت می‌دهد تا بدونِ پرداخت هزینه مالی و جانی‌ که نویسنده یا شخصیت‌های کتاب پرداخت کرده‌اند، تجربه آن‌ها را مال خود کند.این محکم‌ترین دلیل برای کتاب‌خوانی‌ست.جالب است بدانید که با مطالعه مشهورترین رمان های دنیا از سبک زندگی انسان ها در سراسر دنیا آشنا می شویم و می توانیم نقاط مثبت هر یک را در روزمره خود به کار بندیم.",
                    IsDeleted = false,
                    CreateDate = DateTime.Now,
                    LastUpdateDate = DateTime.Now
                },
                new Category
                {
                    Id = 2,
                    Name = "روانشناسی",
                    Description =
                        @"دانش روانشناسی، دانشی است که از نیمه‌ی دوم قرن هفدهم ظهور کرده و شاخه‌های متنوعی دارد. افرادی مانند ژان پیاژه، زیگموند فروید، کارال راجرز و گوستاو یونگ عمرشان را صرف کرده‌اند تا مفاهیم این دانش را تکمیل کنند و از آن برای کمک به بشر در مسیر یک زندگی بهتر بهره ببرند.
در دنیای امروز که زندگی بسیار پرمشغله‌تر از گذشته شده و روابط پیچیده‌تر شده‌اند همه‌ی افراد به این دانش نیاز دارند. نیاز به خودشناسی در دنیای ما که رسانه‌های مختلف انواع محتوا را به خوردمان می‌دهند و معیارهای متعددی را برای خوشبختی و موفقیت معرفی می‌کنند بسیار بیشتر از گذشته است. امروزه برای یک ازدواج موفق درک درست از شخصیت خودمان و طرف مقابل ضروری است و برای داشتن یک خانواده‌ی سالم نیاز داریم اصول تربیتی را بهتر فرا بگیریم. استفاده از روانشناس بالینی بسیار مفید است اما ممکن است همه به چنین شرایط دسترسی نداشته باشند. جای نگرانی نیست، این روزها دیگر کتاب‌های روانشناسی فقط به کتاب‌های دانشگاهی که مخصوص دانشجویان و متخصصان هستند محدود نمی‌شوند و انواع کتاب فیزیکی و صوتی برای گروه‌های مختلف نوشته‌شده‌اند و به‌ راحتی می‌توانید متناسب با نیازتان یک گزینه‌ی خوب را انتخاب کنید.",
                    IsDeleted = false,
                    CreateDate = DateTime.Now,
                    LastUpdateDate = DateTime.Now
                },
                new Category
                {
                    Id = 3,
                    Name = "شعر",
                    Description =
                        @"شعر کلامی تاثیر گذار و سخنی خیال انگیز است که موزون سروده می شود. از زمانی که انسان با مفهوم شعر آشنا شده است همواره آن را آهنگین یافته و مسحور و مفتون آن گشته است.  شاعر نقاش زبردستی است که خوبی ها و بدی ها را به زیبایی در قالب کلمات موزون به تصویر می کشد و با سرودن اشعار لطیف و بدیع توجه همگان را به شعر معطوف می دارد.
در این میان همواره شعر های عاشقانه و احساسی در طول تاریخ مورد توجه بسیار بوده اند و داستان ها و حکایت های عاشقانه بسیاری به صورت نظم در ادبیات کهن ایران برجای مانده است که در میان آن ها می توان به کتب شعر عاشقانه خسرو و شیرین، لیلی و مجنون و شیرین و فرهاد اشاره کرد.",
                    IsDeleted = false,
                    CreateDate = DateTime.Now,
                    LastUpdateDate = DateTime.Now
                },
                new Category
                {
                    Id = 4,
                    Name = "کودک",
                    Description =
                        @"اهمیت آموزش کودکان و پرورش ذهن آن‌ها برای درک جهانی که در آن زندگی می‌کنند بر کسی پوشیده نیست. کودکان به‌واسطه‌ی کتاب‌ها و دیگر انواع محتوا با پدیده‌های گوناگون آشنا می‌شوند و باعث درک بهتر آنها از پیرامون خود می‌شود تا بتوانند در موقعیت‌های مختلف واکنش مناسبی از خود نشان دهند. کودکان قشری هستند که معمولاً خودشان محتوا را انتخاب نمی‌کنند و نقش خانواده و مربی در معرفی و تهیه آن بسیار زیاد است. برای همین کسب آگاهی و انتخاب محتوای مناسب برای کودکان توسط والدین و خانواده بسیار حائز اهمیت است. کودکان با مطالعه‌ی کتاب‌های علمی می‌توانند پاسخ سوالات خود را پیدا کنند و یا کنجکاو شوند. همچنین کتاب‌های داستان و رمان می‌تواند به آن‌ها کمک کند تا با شخصیت‌های بیشتری آشنا شوند و تجربیات بیشتری کسب کنند و از همه مهم‌تر قوه‌ی تخیل کودکان نیز رشد پیدا کند. یکی از مواردی که باید در خرید کتاب کودک به آن توجه کنیم رده‌ی سنی است.",
                    IsDeleted = false,
                    CreateDate = DateTime.Now,
                    LastUpdateDate = DateTime.Now
                },
                new Category
                {
                    Id = 5,
                    Name = "فلسفه",
                    Description =
                        @"اگر بخواهیم از تعریف کلمه‌ی فلسفه شروع کنیم این کلمه از کلمه‌ی یونانی فیلوسوفیا گرفته شده است و طبق تعریف ویکی پدیا به‌معنای مطالعه پرسش‌های بنیادین عالم است. تاریخ فلسفه تاریخ پر فراز و نشیبی است که از زمان سقراط اولین فیلسوف بزرگ یونان آغاز شده و با افرادی مانند فردریش نیچه، برتراند راسل و ویل دورانت تا امروز ادامه داشته و گسترده شده است. امروز اگر بخواهیم از فلسفه حرف بزنیم باید بدانیم منظورمان فلسفه‌ی غرب است که در یونان ریشه دارد یا می‌خواهیم از فلسفه‌ی شرق حرف بزنیم؟ فلسفه دیگر مانند گذشته محدود نیست و آثار فلسفی هم موضوعات زیادی از فلسفه اخلاق و فلسفه سیاسی تا فلسفه اسلامی و ... را پوشش می‌دهند. گروهی از فلاسفه معتقدند فلسفه تنها متعلق به فیلسوفان است و در زندگی مردم عادی نقشی ندارد اما گروهی هم تلاش کرده‌اند با معرفی کتاب‌هایی مانند رمان‌های فلسفی یا کتاب‌های فلسفی روانشناسی آن را با زندگی روزمره بیامیزند و همین باعث تنوع در آثار فلسفی شده است. ",
                    IsDeleted = false,
                    CreateDate = DateTime.Now,
                    LastUpdateDate = DateTime.Now
                },
                new Category
                {
                    Id = 6,
                    Name = "اقتصاد",
                    Description =
                        @"اقتصاد در بطن زندگی انسان ریشه دوانده و زندگی روزمره را به شدت تحت تاثیر قرار داده است. ما بدون آنکه به علم اقتصاد و پیچیدگی‌های آن بیاندیشیم، تصمیم‌هایی می‌گیریم که اقتصاد آن را اداره می‌کند. مقایسه‌ی تورهای مسافرتی، خرید اشتراک اینترنت، تعویض ماشین همه و همه به محاسبات اقتصادی و نوع نگاه ما به آن بستگی دارد. علم اقتصاد به زبان ساده به این شکل تعریف می‌شود: یک نظام اقتصادی مربوط به یک منطقه سیاسی یا جغرافیایی خاص است و تولید، توزیع و مصرف کالا و خدمات را دربرمی‌گیرد. در اقتصاد 4 عامل نقش کلیدی ایفا می‌کند: منابع انسانی، منابع مالی، زمین و کسب و کار",
                    IsDeleted = false,
                    CreateDate = DateTime.Now,
                    LastUpdateDate = DateTime.Now
                }
            );

            #endregion
        }
    }
}